Revit 2027 API
RevisionNumberType Enumeration
 Determines how a particular revision will be numbered.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RevisionNumberType
Public Enumeration RevisionNumberType
public enum class RevisionNumberType
type RevisionNumberType
Members
Member name | Value | Description
Alphanumeric | 3 |  The Revision Number will be a string taken from a user-specified sequence of arbitrary strings.
None | 2 |  No Revision Number will be assigned.
Numeric | 0 |  The Revision Number will be a number.
See Also
Reference
Autodesk.Revit.DB Namespace